import streamlit as st

st.set_page_config(page_title="#ATegypT", page_icon="🇪🇬")

menu = st.sidebar.radio("استكشف التاريخ:", ["الرئيسية", "أسلوب الحياة", "أسرار الصناعة"])

if menu == "الرئيسية":
    st.title("🏛️ #ATegypT")
    st.subheader("بوابتك الرقمية لعظمة التاريخ المصري")
    st.info("استخدم القائمة الجانبية للتنقل.")

elif menu == "أسلوب الحياة":
    st.header("أسلوب الحياة والملابس الفرعونية")
    st.write("الكتان: كان هو القماش الأساسي لسهولته في التعامل مع الحرارة.")
    st.write("الكحل: لم يكن للزينة فقط، بل كان يحمي العيون من الشمس.")
    st.write("الاهتمام بالنظافة: كان المصري القديم مثالاً في الطهارة والنظام."  elif menu == "أسرار الصناعة":
    st.header("أسرار الصناعة والفلك")
    st.write("التحنيط: كيمياء طبية حيرت العالم وما زالت تُدرس.")
    st.write("الفلك: بنوا الأهرامات بتوافق فلكي دقيق جداً مع النجوم.")
    st.write("الورق: المصريون هم أول من اخترع ورق البردي.")
